bookers2/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @user = current_user
    @book = Book.new
    @books = Book.all

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "test_title"], ["body", "test_opinion"], ["created_at", "2021-06-16 14:22:28.191663"], ["updated_at", "2021-06-16 14:22:28.191663"], ["user_id", 1]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:notice] = "You have created book successfully."
      redirect_to book_path(@book.id)
    else
      @user = current_user
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def show
    @book = Book.new
    @book_detail = Book.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def correct_post
    @book = Book.find(params[:id])